---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.CircuitSequence.Numerical
enum: Autodesk.Revit.DB.Electrical.CircuitSequence
source: html/6875e36f-34fd-160c-1c64-69e75d0cd30f.htm
---
# Autodesk.Revit.DB.Electrical.CircuitSequence.Numerical

Create new circuits numerically (1,2,3,4,5,6,7,8,9,10,11,12).